app/controllers/pulses_controller.rb

SELECT * FROM `pulses`
---
  def index
    @pulses = Pulse.all

INSERT INTO `pulses` (`updated_at`, `title`, `expired_at`, `description`, `published_at`, `last_pulsed_at`, `synopsis`, `started_at`, `created_at`) VALUES('2010-03-30 00:42:58', 'Test Pulse title', '2010-03-30 00:00:00', 'get a big discount.', '2010-03-30 00:00:00', '2010-03-30 00:00:00', 'yo, this is pretty cool', '2010-03-30 00:00:00', '2010-03-30 00:42:58')
---
  def create
    @pulse = Pulse.new(params[:pulse])

    respond_to do |format|
      if @pulse.save

DELETE FROM `pulses` WHERE `id` = 3
---
  def destroy
    @pulse.destroy

SELECT * FROM `pulses` WHERE (`pulses`.`id` = 3)
---
    def find_pulse
      @pulse = Pulse.find(params[:id])